Revit 2024 API
FilterDoubleRule Class
 A filter rule that operates on double-precision numeric values in a Revit project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class FilterDoubleRule : FilterNumericValueRule
Visual Basic
Public Class FilterDoubleRule _
	Inherits FilterNumericValueRule
Visual C++
public ref class FilterDoubleRule : public FilterNumericValueRule
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterNumericValueRule
 Autodesk.Revit.DB.FilterDoubleRule
See Also
FilterDoubleRule Members
Autodesk.Revit.DB Namespace